10/data/attachments/c4a2c6c43a0beb02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Joseph_bill_Friend_35577_0</nif:username>
            <nif:friendToBeRequested>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>